import pandas as pd

data = {
    '이름' : ['강나래', '강태원', '강호림', '김수찬', '김재욱', '박동현', '박혜정', '송근열'],
    '학교' : ['신림고', '신림고', '신림고', '신림고', '신림고', '디지털고', '디지털고', '디지털고'],
    '신장' : [197, 184, 168, 187, 188, 202, 188, 190],
    '국어' : [90, 40, 80, 40, 15, 80, 55, 100],
    '영어' : [85, 35, 75, 60, 20, 100, 65, 85],
    '수학' : [100, 50, 70, 70, 10, 95, 45, 90],
    '과학' : [95, 55, 80, 75, 35, 85, 40, 95],
    '사회' : [85, 25, 75, 80, 10, 80, 35, 95],
    'SW특기' : ['Python', 'Java', 'Javascript', '', '', 'C', 'PYTHON', 'C#']
}

# df = pd.DataFrame(data, index = ["1번", "2번", "3번", "4번", "5번", "6번", "7번", "8번"])
# df.index.name = "지원번호"
# # print(df['이름']) # 판다스 형태로 출력
# # print(df[['이름', '학교']])  # 2개 이상 출력 시 [] 해줘야
# df = pd.DataFrame(data, columns=['이름', '학교', '신장'])
# print(df)
# # 없는 키 출력 시 Error!


df = pd.DataFrame(data, index = ["1번", "2번", "3번", "4번", "5번", "6번", "7번", "8번"])
df.index.name = "지원번호"
# print(df.reset_index())
df.reset_index(drop=True, inplace=True)
print(df)